# Створюємо список з 6 цілих чисел
numbers = [10, 3, 7, 25, 1, 8]

# Додаємо -5 на другу позицію (індекс 1)
numbers.insert(1, -5)

# Знаходимо мінімальний та максимальний елемент
minimum = min(numbers)
maximum = max(numbers)

# Додаємо список [1,2,3] починаючи з третього елемента (індекс 2)
numbers.insert(2, [1, 2, 3])

# Додаємо в кінець прізвище та ім'я
numbers.append("Трухан Софія")

# Визначаємо кількість елементів
count = len(numbers)

print("Список:", numbers)
print("Мінімальний елемент:", minimum)
print("Максимальний елемент:", maximum)
print("Кількість елементів:", count)

