text = """Люблю прогулянки та вечірній Львів.
Особливо вечори з родиною, але зараз складно так збиратись як колись.
Війна складна штука, особливо якщо тато воює(.
Також обожнюю тваринок, особливо собачок.
Надзвичайно подобається музика. Вона так розслабляє.
Колись займалась танцями, але кинула через травму.
Улюблена пора року - зима.
"""

# Підрахунок літери "а"
count_a = text.count("а")

print("Кількість символів 'а':", count_a)

# Виведення по одному реченню
sentences = text.split(". ")
for sentence in sentences:
    print(sentence.strip())
